sj15712795029/stm32_sdio_wifi_marvell8801_wifi/STM32F4_WIFI_综合例程/component/wifi/marvell88w8801_core.h
/** Card Event definition : AMSDU aggr control */
#define EVENT_AMSDU_AGGR_CTRL           0x00000042

/** Card Event definition: WEP ICV error */
#define EVENT_WEP_ICV_ERR               0x00000046

/** Card Event definition : Host sleep enable */
#define EVENT_HS_ACT_REQ                0x00000047

/** Card Event definition : BW changed */
#define EVENT_BW_CHANGE                 0x00000048

/** WIFIDIRECT generic event */
#define EVENT_WIFIDIRECT_GENERIC_EVENT         0x00000049
/** WIFIDIRECT service discovery event */
#define EVENT_WIFIDIRECT_SERVICE_DISCOVERY     0x0000004a
/** Remain on Channel expired event */
#define EVENT_REMAIN_ON_CHANNEL_EXPIRED        0x0000005f

/** Event definition : FW debug information */
#define EVENT_FW_DEBUG_INFO             0x00000063

/** Event definition: RXBA_SYNC */
#define EVENT_RXBA_SYNC                 0x00000059

/** Event ID: STA deauth */
#define EVENT_MICRO_AP_STA_DEAUTH       0x0000002c
/** Event ID: STA assoicated */
#define EVENT_MICRO_AP_STA_ASSOC        0x0000002d
/** Event ID: BSS started */
#define EVENT_MICRO_AP_BSS_START        0x0000002e
/** Event ID: BSS idle event */
#define EVENT_MICRO_AP_BSS_IDLE         0x00000043
/** Event ID: BSS active event */
#define EVENT_MICRO_AP_BSS_ACTIVE       0x00000044
/** Event ID: RSN Connect event */
#define MICRO_AP_EV_RSN_CONNECT             0x00000051

/** Event ID: TX data pause event */
#define EVENT_TX_DATA_PAUSE                  0x00000055

/** Event ID: SAD Report */
#define EVENT_SAD_REPORT                     0x00000066

/** Event ID: Tx status */
#define EVENT_TX_STATUS_REPORT               0x00000074

#define EVENT_BT_COEX_WLAN_PARA_CHANGE	 0x00000076

/**  MAC Address Length */
#define MAC_ADDR_LENGTH            6
#define MAX_SSID_LENGTH			32
#define MAX_PHRASE_LENGTH			64
/** Setup the number of rates passed in the driver/firmware API */
#define HOSTCMD_SUPPORTED_RATES         14
/** country code length  used for 802.11D */
#define COUNTRY_CODE_LEN    3
/** Maximum number of AC QOS queues available in the driver/firmware */
#define MAX_AC_QUEUES               4
/** Size of a TSPEC.  Used to allocate necessary buffer space in commands */
#define WMM_TSPEC_SIZE              63
/** Extra IE bytes allocated in messages for appended IEs after a TSPEC */
#define WMM_ADDTS_EXTRA_IE_BYTES    256
/** Extra TLV bytes allocated in messages for configuring WMM Queues */
#define WMM_QUEUE_CONFIG_EXTRA_TLV_BYTES 64
/** Number of bins in the histogram for the HostCmd_DS_WMM_QUEUE_STATS */
#define WMM_STATS_PKTS_HIST_BINS  7
/** Max IE index to FW */
#define MAX_MGMT_IE_INDEX_TO_FW         4
/** Max IE index per BSS */
#define MAX_MGMT_IE_INDEX       12



#define MLAN_PACK_END	__attribute__ ((packed))

typedef enum
{
    WIFI_SECURITYTYPE_NONE = 0,
    WIFI_SECURITYTYPE_WEP = 1,
    WIFI_SECURITYTYPE_WPA = 2,
    WIFI_SECURITYTYPE_WPA2 = 3
} WiFi_SecurityType;

/**  BSS type */
typedef enum _mlan_bss_type
{
    BSS_TYPE_STA = 0,
    BSS_TYPE_UAP = 1,
    BSS_TYPE_WIFIDIRECT = 2,
    BSS_TYPE_ANY = 0xff,
} mlan_bss_type;


typedef enum
{
    WIFI_AUTH_MODE_OPEN = 0x00,
    WIFI_AUTH_MODE_SHARED = 0x01,
    WIFI_AUTH_MODE_NETWORK_EAP = 0x80
} WiFi_AuthenticationType;

typedef  struct
{
    uint8_t oui[3];
    uint8_t oui_type;
    uint16_t version;
    uint8_t multicast_oui[4];
    uint16_t unicast_num;
    uint8_t unicast_oui[1][4];
    uint16_t auth_num; 
    uint8_t auth_oui[1][4];
} MLAN_PACK_END WiFi_Vendor;

/** MrvlIEtypesHeader_t */
typedef struct MrvlIEtypesHeader
{
    /** Header type */
    uint16_t type;
    /** Header length */
    uint16_t len;
} MLAN_PACK_END  MrvlIEtypesHeader_t;

typedef  struct
{
    MrvlIEtypesHeader_t header;
    uint8_t channel;
} MLAN_PACK_END  MrvlIETypes_PhyParamDSSet_t;

typedef struct _MrvlIETypes_Vendor_context_t
{
    /** OUI */
    uint8_t oui[3];
    /** OUI type */
    uint8_t oui_type;
    /** OUI subtype */
    uint8_t oui_subtype;
    /** Version */
    uint8_t version;
}  MLAN_PACK_END MrvlIETypes_Vendor_context_t;

/** Vendor specific IE header */
typedef struct _MrvlIETypes_Vendor_t
{
    MrvlIEtypesHeader_t header;
    uint8_t vendor[64];
}  MLAN_PACK_END MrvlIETypes_Vendor_t;

/** Vendor specific IE header */
typedef struct _MrvlIETypes_RSN_t
{
    MrvlIEtypesHeader_t header;
    uint8_t rsn[64];
}  MLAN_PACK_END MrvlIETypes_RSN_t;

typedef  struct
{
    MrvlIEtypesHeader_t header;
    uint8_t rate[1];
} MLAN_PACK_END  MrvlIETypes_OpRateSet_t;

typedef  struct
{
    MrvlIEtypesHeader_t header;
    uint8_t count;
    uint8_t period;
    uint16_t max_duration;
    uint16_t duration_remaining;
} MLAN_PACK_END MrvlIETypes_CfParamSet_t;

typedef  struct
{
    MrvlIEtypesHeader_t header;
    uint16_t auth_type;
} MLAN_PACK_END MrvlIETypes_AuthType_t;

typedef  struct
{
    MrvlIEtypesHeader_t header;
    uint8_t mac_address[MAC_ADDR_LENGTH];
} MLAN_PACK_END MrvlIETypes_BSSIDList_t;

typedef struct _IEEEtypes_CapInfo_t
{
    /** Capability Bit Map : ESS */
    uint8_t ess:1;
    /** Capability Bit Map : IBSS */
    uint8_t ibss:1;
    /** Capability Bit Map : CF pollable */
    uint8_t cf_pollable:1;
    /** Capability Bit Map : CF poll request */
    uint8_t cf_poll_rqst:1;
    /** Capability Bit Map : privacy */
    uint8_t privacy:1;
    /** Capability Bit Map : Short preamble */
    uint8_t short_preamble:1;
    /** Capability Bit Map : PBCC */
    uint8_t pbcc:1;
    /** Capability Bit Map : Channel agility */
    uint8_t chan_agility:1;
    /** Capability Bit Map : Spectrum management */
    uint8_t spectrum_mgmt:1;
    /** Capability Bit Map : Reserved */
    uint8_t rsrvd3:1;
    /** Capability Bit Map : Short slot time */
    uint8_t short_slot_time:1;
    /** Capability Bit Map : APSD */
    uint8_t apsd:1;
    /** Capability Bit Map : Reserved */
    uint8_t rsvrd2:1;
    /** Capability Bit Map : DSS OFDM */
    uint8_t dsss_ofdm:1;
    /** Capability Bit Map : Reserved */
    uint8_t rsrvd1:2;
} MLAN_PACK_END IEEEtypes_CapInfo_t, *pIEEEtypes_CapInfo_t;

/** 16 bit unsigned integer */
typedef uint16_t IEEEtypes_AId_t;
/** 16 bit unsigned integer */
typedef uint16_t IEEEtypes_StatusCode_t;


