sj15712795029/stm32_sdio_wifi_marvell8801_wifi/STM32F4_WIFI_综合例程/component/wifi/marvell88w8801_core.h
/**  HostCmd_DS_802_11_CFG_DATA */
typedef struct _HostCmd_DS_802_11_CFG_DATA
{
    /** Action */
    uint16_t action;
    /** Type */
    uint16_t type;
    /** Data length */
    uint16_t data_len;
    /** Data */
} MLAN_PACK_END HostCmd_DS_802_11_CFG_DATA;

/** HostCmd_DS_MAC_CONTROL */
typedef  struct _HostCmd_DS_MAC_CONTROL
{
    /** Action */
    uint32_t action;
} MLAN_PACK_END HostCmd_DS_MAC_CONTROL;


/** HostCmd_DS_802_11_MAC_ADDRESS */
typedef  struct _HostCmd_DS_802_11_MAC_ADDRESS
{
    /** Action */
    uint16_t action;
    /** MAC address */
    uint8_t mac_addr[MAC_ADDR_LENGTH];
} MLAN_PACK_END  HostCmd_DS_802_11_MAC_ADDRESS;

#define MAX_MULTICAST_LIST_SIZE	32
/**  HostCmd_CMD_MAC_MULTICAST_ADR */
typedef  struct _HostCmd_DS_MAC_MULTICAST_ADR
{
    /** Action */
    uint16_t action;
    /** Number of addresses */
    uint16_t num_of_adrs;
    /** List of MAC */
    uint8_t mac_list[MAC_ADDR_LENGTH * MAX_MULTICAST_LIST_SIZE];
} MLAN_PACK_END  HostCmd_DS_MAC_MULTICAST_ADR;

/** HostCmd_DS_802_11_GET_LOG */
typedef  struct _HostCmd_DS_802_11_GET_LOG
{
    /** Number of multicast transmitted frames */
    uint32_t mcast_tx_frame;
    /** Number of failures */
    uint32_t failed;
    /** Number of retries */
    uint32_t retry;
    /** Number of multiretries */
    uint32_t multiretry;
    /** Number of duplicate frames */
    uint32_t frame_dup;
    /** Number of RTS success */
    uint32_t rts_success;
    /** Number of RTS failure */
    uint32_t rts_failure;
    /** Number of acknowledgement failure */
    uint32_t ack_failure;
    /** Number of fragmented packets received */
    uint32_t rx_frag;
    /** Number of multicast frames received */
    uint32_t mcast_rx_frame;
    /** FCS error */
    uint32_t fcs_error;
    /** Number of transmitted frames */
    uint32_t tx_frame;
    /** Reserved field */
    uint32_t reserved;
    /** Number of WEP icv error for each key */
    uint32_t wep_icv_err_cnt[4];
    /** Beacon received count */
    uint32_t bcn_rcv_cnt;
    /** Beacon missed count */
    uint32_t bcn_miss_cnt;
} MLAN_PACK_END  HostCmd_DS_802_11_GET_LOG;

/**  HostCmd_DS_CMD_802_11_RSSI_INFO */
typedef  struct _HostCmd_DS_802_11_RSSI_INFO
{
    /** Action */
    uint16_t action;
    /** Parameter used for exponential averaging for Data */
    uint16_t ndata;
    /** Parameter used for exponential averaging for Beacon */
    uint16_t nbcn;
    /** Reserved field 0 */
    uint16_t reserved[9];
    /** Reserved field 1 */
    uint64_t reserved_1;
} MLAN_PACK_END  HostCmd_DS_802_11_RSSI_INFO;

/** HostCmd_DS_802_11_RSSI_INFO_RSP */
typedef  struct _HostCmd_DS_802_11_RSSI_INFO_RSP
{
    /** Action */
    uint16_t action;
    /** Parameter used for exponential averaging for Data */
    uint16_t ndata;
    /** Parameter used for exponential averaging for beacon */
    uint16_t nbcn;
    /** Last Data RSSI in dBm */
    int16_t data_rssi_last;
    /** Last Data NF in dBm */
    int16_t data_nf_last;
    /** AVG DATA RSSI in dBm */
    int16_t data_rssi_avg;
    /** AVG DATA NF in dBm */
    int16_t data_nf_avg;
    /** Last BEACON RSSI in dBm */
    int16_t bcn_rssi_last;
    /** Last BEACON NF in dBm */
    int16_t bcn_nf_last;
    /** AVG BEACON RSSI in dBm */
    int16_t bcn_rssi_avg;
    /** AVG BEACON NF in dBm */
    int16_t bcn_nf_avg;
    /** Last RSSI Beacon TSF */
    uint64_t tsf_bcn;
} MLAN_PACK_END  HostCmd_DS_802_11_RSSI_INFO_RSP;

/**  HostCmd_CMD_802_11_SNMP_MIB */
typedef  struct _HostCmd_DS_802_11_SNMP_MIB
{
    /** SNMP query type */
    uint16_t query_type;
    /** SNMP object ID */
    uint16_t oid;
    /** SNMP buffer size */
    uint16_t buf_size;
    /** Value */
    uint8_t value[1];
} MLAN_PACK_END  HostCmd_DS_802_11_SNMP_MIB;

/** HostCmd_CMD_802_11_RADIO_CONTROL */
typedef  struct _HostCmd_DS_802_11_RADIO_CONTROL
{
    /** Action */
    uint16_t action;
    /** Control */
    uint16_t control;
} MLAN_PACK_END  HostCmd_DS_802_11_RADIO_CONTROL;

/** HostCmd_CMD_802_11_RF_CHANNEL */
typedef  struct _HostCmd_DS_802_11_RF_CHANNEL
{
    /** Action */
    uint16_t action;
    /** Current channel */
    uint16_t current_channel;
    /** RF type */
    uint16_t rf_type;
    /** Reserved field */
    uint16_t reserved;
    /** List of channels */
    uint8_t channel_list[32];

} MLAN_PACK_END  HostCmd_DS_802_11_RF_CHANNEL;

/**_HostCmd_TX_RATE_QUERY */
typedef  struct _HostCmd_TX_RATE_QUERY
{
    /** Tx rate */
    uint8_t tx_rate;
    /** Ht Info [Bit 0] RxRate format: LG=0, HT=1
     * [Bit 1]  HT Bandwidth: BW20 = 0, BW40 = 1
     * [Bit 2]  HT Guard Interval: LGI = 0, SGI = 1 */
    uint8_t ht_info;
} MLAN_PACK_END  HostCmd_TX_RATE_QUERY;

/** HostCmd_DS_TX_RATE_CFG */
typedef  struct _HostCmd_DS_TX_RATE_CFG
{
    /** Action */
    uint16_t action;
    /** Tx Rate Configuration Index */
    uint16_t cfg_index;
    /* MrvlRateScope_t RateScope; MrvlRateDropPattern_t RateDrop; */
} MLAN_PACK_END  HostCmd_DS_TX_RATE_CFG;

/** HostCmd_CMD_TXPWR_CFG */
typedef  struct _HostCmd_DS_TXPWR_CFG
{
    /** Action */
    uint16_t action;
    /** Power group configuration index */
    uint16_t cfg_index;
    /** Power group configuration mode */
    uint32_t mode;
    /* MrvlTypes_Power_Group_t PowerGrpCfg[0] */
} MLAN_PACK_END  HostCmd_DS_TXPWR_CFG;

/** HostCmd_CMD_802_11_RF_TX_POWER */
typedef  struct _HostCmd_DS_802_11_RF_TX_POWER
{
    /** Action */
    uint16_t action;
    /** Current power level */
    int16_t current_level;
    /** Maximum power */
    int8_t max_power;
    /** Minimum power */
    int8_t min_power;
} MLAN_PACK_END  HostCmd_DS_802_11_RF_TX_POWER;

/** HostCmd_CMD_802_11_RF_ANTENNA */
typedef  struct _HostCmd_DS_802_11_RF_ANTENNA
{
    /** Action */
    uint16_t action;
    /**  Antenna or 0xffff (diversity) */
    uint16_t antenna_mode;
} MLAN_PACK_END  HostCmd_DS_802_11_RF_ANTENNA;


/** Structure definition for the new ieee power save parameters*/
typedef  struct __ps_param
{
    /** Null packet interval */
    uint16_t null_pkt_interval;
    /** Num dtims */
    uint16_t multiple_dtims;
    /** becaon miss interval */
    uint16_t bcn_miss_timeout;
    /** local listen interval */
    uint16_t local_listen_interval;
    /** Adhoc awake period */
    uint16_t adhoc_wake_period;
    /** mode - (0x01 - firmware to automatically choose PS_POLL or NULL mode,
     *  0x02 - PS_POLL, 0x03 - NULL mode )
     */
    uint16_t mode;
    /** Delay to PS in milliseconds */
    uint16_t delay_to_ps;
} MLAN_PACK_END  ps_param;

/** Structure definition for the new auto deep sleep command */
typedef  struct __auto_ds_param
{
    /** Deep sleep inactivity timeout */
    uint16_t deep_sleep_timeout;
} MLAN_PACK_END auto_ds_param;

/** Structure definition for sleep confirmation in the new ps command */
typedef  struct __sleep_confirm_param
{
    /** response control 0x00 - response not needed, 0x01 - response needed */
    uint16_t resp_ctrl;
} MLAN_PACK_END  sleep_confirm_param;

