sj15712795029/stm32_sdio_wifi_marvell8801_wifi/STM32F4_WIFI_综合例程/component/wifi/marvell88w8801_core.h
    uint8_t select_is_userpri:1;
    /**< Set if select_bin is UP, Clear for AC */
    uint8_t select_bin:7;	/**< WMM_AC_BK(0) to WMM_AC_VO(3), or TID */
    uint16_t pkt_count;    /**< Number of successful packets transmitted */
    uint16_t pkt_loss;	    /**< Packets lost; not included in pktCount */
    uint32_t avg_queue_delay;
    /**< Average Queue delay in microsec */
    uint32_t avg_tx_delay; /**< Average Transmission delay in microsec */
    uint16_t used_time;    /**< Calc used time - units of 32 microsec */
    uint16_t policed_time; /**< Calc policed time - units of 32 microsec */
    /** @brief Queue Delay Histogram; number of packets per queue delay range
     *
     *  [0] -  0ms <= delay < 5ms
     *  [1] -  5ms <= delay < 10ms
     *  [2] - 10ms <= delay < 20ms
     *  [3] - 20ms <= delay < 30ms
     *  [4] - 30ms <= delay < 40ms
     *  [5] - 40ms <= delay < 50ms
     *  [6] - 50ms <= delay < msduLifetime (TUs)
     */
    uint16_t delay_histogram[WMM_STATS_PKTS_HIST_BINS];
    /** Reserved */
    uint16_t reserved_1;
} MLAN_PACK_END HostCmd_DS_WMM_QUEUE_STATS;

/**
 *  @brief Command structure for the HostCmd_CMD_WMM_TS_STATUS firmware cmd
 *
 *  Query the firmware to get the status of the WMM Traffic Streams
 */
typedef  struct
{
    /** TSID: Range: 0->7 */
    uint8_t tid;
    /** TSID specified is valid */
    uint8_t valid;
    /** AC TSID is active on */
    uint8_t access_category;
    /** UP specified for the TSID */
    uint8_t user_priority;
    /** Power save mode for TSID: 0 (legacy), 1 (UAPSD) */
    uint8_t psb;
    /** Uplink(1), Downlink(2), Bidirectional(3) */
    uint8_t flow_dir;
    /** Medium time granted for the TSID */
    uint16_t medium_time;
} MLAN_PACK_END  HostCmd_DS_WMM_TS_STATUS;


/** Key Info flag for multicast key */
#define KEY_INFO_MCAST_KEY      0x01
/** Key Info flag for unicast key */
#define KEY_INFO_UCAST_KEY      0x02
/** Key Info flag for enable key */
#define KEY_INFO_ENABLE_KEY     0x04
/** Key Info flag for default key */
#define KEY_INFO_DEFAULT_KEY    0x08
/** Key Info flag for TX key */
#define KEY_INFO_TX_KEY         0x10
/** Key Info flag for RX key */
#define KEY_INFO_RX_KEY         0x20
#define KEY_INFO_CMAC_AES_KEY   0x400
/** PN size for WPA/WPA2 */
#define WPA_PN_SIZE             8
/** PN size for PMF IGTK */
#define IGTK_PN_SIZE            8
/** WAPI KEY size */
#define WAPI_KEY_SIZE           32
/** key params fix size */
#define KEY_PARAMS_FIXED_LEN    10
/** key index mask */
#define KEY_INDEX_MASK          0xf
/* A few details needed for WEP (Wireless Equivalent Privacy) */
/** 104 bits */
#define MAX_WEP_KEY_SIZE	13
/** 40 bits RC4 - WEP */
#define MIN_WEP_KEY_SIZE	5
/** packet number size */
#define PN_SIZE			16
/** max seq size of wpa/wpa2 key */
#define SEQ_MAX_SIZE        8
/** WPA AES key length */
#define WPA_AES_KEY_LEN                 16
/** WPA TKIP key length */
#define WPA_TKIP_KEY_LEN                32
/** WPA AES IGTK key length */
#define CMAC_AES_KEY_LEN                16
/** IGTK key length */
#define WPA_IGTK_KEY_LEN                16
/** wep_param */
typedef  struct _wep_param_t
{
    /** key_len */
    uint16_t key_len;
    /** wep key */
    uint8_t key[MAX_WEP_KEY_SIZE];
} MLAN_PACK_END  wep_param_t;

/** tkip_param */
typedef  struct _tkip_param
{
    /** Rx packet num */
    uint8_t pn[WPA_PN_SIZE];
    /** key_len */
    uint16_t key_len;
    /** tkip key */
    uint8_t key[WPA_TKIP_KEY_LEN];
} MLAN_PACK_END tkip_param;

/** aes_param */
typedef  struct _aes_param
{
    /** Rx packet num */
    uint8_t pn[WPA_PN_SIZE];
    /** key_len */
    uint16_t key_len;
    /** aes key */
    uint8_t key[WPA_AES_KEY_LEN];
} MLAN_PACK_END aes_param;

/** wapi_param */
typedef  struct _wapi_param
{
    /** Rx packet num */
    uint8_t pn[PN_SIZE];
    /** key_len */
    uint16_t key_len;
    /** wapi key */
    uint8_t key[WAPI_KEY_SIZE];
} MLAN_PACK_END  wapi_param;

/** cmac_aes_param */
typedef  struct _cmac_aes_param
{
    /** IGTK pn */
    uint8_t ipn[IGTK_PN_SIZE];
    /** key_len */
    uint16_t key_len;
    /** aes key */
    uint8_t key[CMAC_AES_KEY_LEN];
} MLAN_PACK_END  cmac_aes_param;

/** MrvlIEtype_KeyParamSet_t */
typedef  struct _MrvlIEtype_KeyParamSetV2_t
{
    /** Type ID */
    uint16_t type;
    /** Length of Payload */
    uint16_t length;
    /** mac address */
    uint8_t mac_addr[MAC_ADDR_LENGTH];
    /** key index */
    uint8_t key_idx;
    /** Type of Key: WEP=0, TKIP=1, AES=2, WAPI=3 AES_CMAC=4 */
    uint8_t key_type;
    /** Key Control Info specific to a key_type_id */
    uint16_t key_info;
    union
    {
        /** wep key param */
        wep_param_t wep;
        /** tkip key param */
        tkip_param tkip;
        /** aes key param */
        aes_param aes;
        /** wapi key param */
        wapi_param wapi;
        /** IGTK key param */
        cmac_aes_param cmac_aes;
    } key_params;
} MLAN_PACK_END MrvlIEtype_KeyParamSetV2_t;

/** HostCmd_DS_802_11_KEY_MATERIAL */
typedef  struct _HostCmd_DS_802_11_KEY_MATERIAL
{
    /** Action */
    uint16_t action;
    /** Key parameter set */
    MrvlIEtype_KeyParamSetV2_t key_param_set;
} MLAN_PACK_END HostCmd_DS_802_11_KEY_MATERIAL;

/** HostCmd_DS_802_11_SUPPLICANT_PMK */
typedef  struct _HostCmd_DS_802_11_SUPPLICANT_PMK
{
    /** CMD Action GET/SET/CLEAR */
    uint16_t action;
    /** CacheResult initialized to 0 */
    uint16_t cache_result;
    /** TLV Buffer */
    uint8_t tlv_buffer[1];
    /** MrvlIEtypes_SsidParamSet_t  SsidParamSet;
      * MrvlIEtypes_PMK_t           Pmk;
      * MrvlIEtypes_Passphrase_t    Passphrase;
      * MrvlIEtypes_Bssid_t         Bssid;
      **/
} MLAN_PACK_END HostCmd_DS_802_11_SUPPLICANT_PMK;

/*
 * This struct will GET the Supplicant supported bitmaps
 * The GET_CURRENT action will get the network profile used
 * for the current assocation.
 * Define data structure for HostCmd_CMD_802_11_SUPPLICANT_PROFILE
 */
typedef  struct _HostCmd_DS_802_11_SUPPLICANT_PROFILE
{
    /** GET/SET/GET_CURRENT */
    uint16_t action;
    /** Reserved */
    uint16_t reserved;
    /** TLVBuffer */
    uint8_t tlv_buf[1];
    /* MrvlIEtypes_EncrProto_t */
} MLAN_PACK_END  HostCmd_DS_802_11_SUPPLICANT_PROFILE;

