sj15712795029/stm32_sdio_wifi_marvell8801_wifi/STM32F4_WIFI_综合例程/component/wifi/marvell88w8801_core.h
typedef  struct _HostCmd_DS_SDIO_GPIO_INT_CONFIG
{
    /** Action */
    uint16_t action;
    /** GPIO interrupt pin */
    uint16_t gpio_pin;
    /** GPIO interrupt edge, 1: failing edge; 0: raising edge */
    uint16_t gpio_int_edge;
    /** GPIO interrupt pulse widthin usec units */
    uint16_t gpio_pulse_width;
} MLAN_PACK_END  HostCmd_DS_SDIO_GPIO_INT_CONFIG;

typedef  struct _HostCmd_DS_SDIO_PULL_CTRL
{
    /** Action */
    uint16_t action;
    /** The delay of pulling up in us */
    uint16_t pull_up;
    /** The delay of pulling down in us */
    uint16_t pull_down;
} MLAN_PACK_END HostCmd_DS_SDIO_PULL_CTRL;

/** HostCmd_DS_SET_BSS_MODE */
typedef  struct _HostCmd_DS_SET_BSS_MODE
{
    /** connection type */
    uint8_t con_type;
} MLAN_PACK_END  HostCmd_DS_SET_BSS_MODE;

/** HostCmd_DS_CMD_TX_DATA_PAUSE */
typedef  struct _HostCmd_DS_CMD_TX_DATA_PAUSE
{
    /** Action */
    uint16_t action;
    /** Enable/disable Tx data pause */
    uint8_t enable_tx_pause;
    /** Max number of TX buffers allowed for all PS clients*/
    uint8_t pause_tx_count;
} MLAN_PACK_END HostCmd_DS_CMD_TX_DATA_PAUSE;

/** HostCmd_DS_REMAIN_ON_CHANNEL */
typedef  struct _HostCmd_DS_REMAIN_ON_CHANNEL
{
    /** Action 0-GET, 1-SET, 4 CLEAR*/
    uint16_t action;
    /** Not used set to zero */
    uint8_t status;
    /** Not used set to zero */
    uint8_t reserved;
    /** Band cfg */
    uint8_t bandcfg;
    /** channel */
    uint8_t channel;
    /** remain time: Unit ms*/
    uint32_t remain_period;
} MLAN_PACK_END HostCmd_DS_REMAIN_ON_CHANNEL;

/** HostCmd_DS_WIFI_DIRECT_MODE */
typedef  struct _HostCmd_DS_WIFI_DIRECT_MODE
{
    /** Action 0-GET, 1-SET*/
    uint16_t action;
    /**0:disable 1:listen 2:GO 3:p2p client 4:find 5:stop find*/
    uint16_t mode;
} MLAN_PACK_END  HostCmd_DS_WIFI_DIRECT_MODE;

/** HostCmd_DS_REMAIN_ON_CHANNEL */
typedef  struct _HostCmd_DS_WIFI_DIRECT_PARAM_CONFIG
{
    /** Action 0-GET, 1-SET */
    uint16_t action;
    /** MrvlIEtypes_NoA_setting_t
     *  MrvlIEtypes_OPP_PS_setting_t
     */
} MLAN_PACK_END  HostCmd_DS_WIFI_DIRECT_PARAM_CONFIG;

struct coalesce_filt_field_param
{
    uint8_t operation;
    uint8_t operand_len;
    uint16_t offset;
    uint8_t operand_byte_stream[4];
} MLAN_PACK_END ;

struct coalesce_receive_filt_rule
{
    MrvlIEtypesHeader_t header;
    uint8_t num_of_fields;
    uint8_t pkt_type;
    uint16_t max_coalescing_delay;
    struct coalesce_filt_field_param params[0];
} MLAN_PACK_END ;

/** HostCmd_DS_COALESCE_CONFIG */
typedef  struct _HostCmd_DS_COALESCE_CONFIG
{
    /** Action 0-GET, 1-SET */
    uint16_t action;
    uint16_t num_of_rules;
    struct coalesce_receive_filt_rule rule[0];
} MLAN_PACK_END  HostCmd_DS_COALESCE_CONFIG;

/** HostCmd_CMD_HS_WAKEUP_REASON */
typedef  struct _HostCmd_DS_HS_WAKEUP_REASON
{
    /** wakeupReason:
      * 0: unknown
      * 1: Broadcast data matched
      * 2: Multicast data matched
      * 3: Unicast data matched
      * 4: Maskable event matched
      * 5. Non-maskable event matched
      * 6: Non-maskable condition matched (EAPoL rekey)
      * 7: Magic pattern matched
      * Others: reserved. (set to 0) */
    uint16_t wakeup_reason;
} MLAN_PACK_END HostCmd_DS_HS_WAKEUP_REASON;

/** HostCmd_CONFIG_LOW_PWR_MODE */
typedef  struct _HostCmd_CONFIG_LOW_PWR_MODE
{
    /** Enable LPM */
    uint8_t enable;
} MLAN_PACK_END  HostCmd_CONFIG_LOW_PWR_MODE;

typedef  struct _HostCmd_DS_RX_PKT_COAL_CFG
{
    /** Action */
    uint16_t action;
    /** Packet threshold */
    uint32_t packet_threshold;
    /** Timeout */
    uint16_t delay;
} MLAN_PACK_END HostCmd_DS_RX_PKT_COAL_CFG;

/** MrvlIEtypes_eapol_pkt_t */
typedef  struct _MrvlIEtypes_eapol_pkt_t
{
    /** Header */
    MrvlIEtypesHeader_t header;
    /** eapol pkt buf */
    uint8_t pkt_buf[0];
} MLAN_PACK_END  MrvlIEtypes_eapol_pkt_t;

/** HostCmd_DS_EAPOL_PKT */
typedef  struct _HostCmd_DS_EAPOL_PKT
{
    /** Action */
    uint16_t action;
    /** TLV buffer */
    MrvlIEtypes_eapol_pkt_t tlv_eapol;
} MLAN_PACK_END  HostCmd_DS_EAPOL_PKT;

/** Ethernet header */
typedef struct
{
    /** Ethernet header destination address */
    uint8_t dest_addr[MAC_ADDR_LENGTH];
    /** Ethernet header source address */
    uint8_t src_addr[MAC_ADDR_LENGTH];
    /** Ethernet header length */
    uint16_t h803_len;

} MLAN_PACK_END Eth803Hdr_t;

/** Rx packet header */
typedef /*MLAN_PACK_START*/ struct
{
    /** Etherner header */
    Eth803Hdr_t eth803_hdr;

} MLAN_PACK_END RxPacketHdr_t;


#define CMD_HDR_SIZE	12
#define CMD_SDIO_HDR_SIZE	4
#define TYPE_DATA	0
#define TYPE_CMD_CMDRSP	1
#define TYPE_EVENT	3
/** HostCmd_DS_COMMAND */
typedef struct  _HostCmd_DS_COMMAND
{
    /** Command Header : pack_len */
    uint16_t pack_len;
    /** Command Header : pack_type */
    uint16_t pack_type;
    /** Command Header : Command */
    uint16_t command;
    /** Command Header : Size */
    uint16_t size;
    /** Command Header : Sequence number */
    uint8_t seq_num;
    /** Command Header : Bss */
    uint8_t bss;
    /** Command Header : Result */
    uint16_t result;
    /** Command Body */
    union
    {
        /** Hardware specifications */
        HostCmd_DS_GET_HW_SPEC hw_spec;
        /** Cfg data */
        HostCmd_DS_802_11_CFG_DATA cfg_data;
        /** MAC control */
        HostCmd_DS_MAC_CONTROL mac_ctrl;
        /** MAC address */
        HostCmd_DS_802_11_MAC_ADDRESS mac_addr;
        /** MAC muticast address */
        HostCmd_DS_MAC_MULTICAST_ADR mc_addr;
        /** Get log */
        HostCmd_DS_802_11_GET_LOG get_log;
        /** RSSI information */
        HostCmd_DS_802_11_RSSI_INFO rssi_info;
        /** RSSI information response */
        HostCmd_DS_802_11_RSSI_INFO_RSP rssi_info_rsp;
        /** SNMP MIB */
        HostCmd_DS_802_11_SNMP_MIB smib;
        /** Radio control */
        HostCmd_DS_802_11_RADIO_CONTROL radio;
        /** RF channel */
        HostCmd_DS_802_11_RF_CHANNEL rf_channel;
        /** Tx rate query */
        HostCmd_TX_RATE_QUERY tx_rate;
        /** Tx rate configuration */
        HostCmd_DS_TX_RATE_CFG tx_rate_cfg;
        /** Tx power configuration */
        HostCmd_DS_TXPWR_CFG txp_cfg;
        /** RF Tx power configuration */
        HostCmd_DS_802_11_RF_TX_POWER txp;

        /** RF antenna */
        HostCmd_DS_802_11_RF_ANTENNA antenna;
        /** Enhanced power save command */
        HostCmd_DS_802_11_PS_MODE_ENH psmode_enh;
        HostCmd_DS_802_11_HS_CFG_ENH opt_hs_cfg;
        /** Scan */
        HostCmd_DS_802_11_SCAN scan;

        /** Mgmt frame subtype mask */
        HostCmd_DS_RX_MGMT_IND rx_mgmt_ind;
        /** Scan response */
        HostCmd_DS_802_11_SCAN_RSP scan_resp;

        HostCmd_DS_802_11_BG_SCAN_CONFIG bg_scan_config;
        HostCmd_DS_802_11_BG_SCAN_QUERY bg_scan_query;
        HostCmd_DS_802_11_BG_SCAN_QUERY_RSP bg_scan_query_resp;
        HostCmd_DS_SUBSCRIBE_EVENT subscribe_event;
        HostCmd_DS_OTP_USER_DATA otp_user_data;
        /** Associate */
        HostCmd_DS_802_11_ASSOCIATE associate;

        /** Associate response */
        HostCmd_DS_802_11_ASSOCIATE_RSP associate_rsp;
        /** Deauthenticate */
        HostCmd_DS_802_11_DEAUTHENTICATE deauth;
        /** Ad-Hoc start */
        HostCmd_DS_802_11_AD_HOC_START adhoc_start;
        /** Ad-Hoc start result */
        HostCmd_DS_802_11_AD_HOC_START_RESULT adhoc_start_result;
        /** Ad-Hoc join result */
        HostCmd_DS_802_11_AD_HOC_JOIN_RESULT adhoc_join_result;
        /** Ad-Hoc join */
        HostCmd_DS_802_11_AD_HOC_JOIN adhoc_join;
        /** Domain information */
        HostCmd_DS_802_11D_DOMAIN_INFO domain_info;
        /** Domain information response */
        HostCmd_DS_802_11D_DOMAIN_INFO_RSP domain_info_resp;
        /** Add BA request */
        HostCmd_DS_11N_ADDBA_REQ add_ba_req;
        /** Add BA response */
        HostCmd_DS_11N_ADDBA_RSP add_ba_rsp;
        /** Delete BA entry */
        HostCmd_DS_11N_DELBA del_ba;
        /** Tx buffer configuration */
        HostCmd_DS_TXBUF_CFG tx_buf;
        /** AMSDU Aggr Ctrl configuration */
        HostCmd_DS_AMSDU_AGGR_CTRL amsdu_aggr_ctrl;
        /** 11n configuration */
        HostCmd_DS_11N_CFG htcfg;
        /** reject addba req conditions configuration */
        HostCmd_DS_REJECT_ADDBA_REQ rejectaddbareq;
        /** WMM status get */
        HostCmd_DS_WMM_GET_STATUS get_wmm_status;
        /** WMM ADDTS */
        HostCmd_DS_WMM_ADDTS_REQ add_ts;
        /** WMM DELTS */
        HostCmd_DS_WMM_DELTS_REQ del_ts;
        /** WMM set/get queue config */
        HostCmd_DS_WMM_QUEUE_CONFIG queue_config;
        /** WMM on/of/get queue statistics */
        HostCmd_DS_WMM_QUEUE_STATS queue_stats;
        /** WMM get traffic stream status */
        HostCmd_DS_WMM_TS_STATUS ts_status;
        /** Key material */
        HostCmd_DS_802_11_KEY_MATERIAL key_material;
        /** E-Supplicant PSK */
        HostCmd_DS_802_11_SUPPLICANT_PMK esupplicant_psk;
        /** E-Supplicant profile */
        HostCmd_DS_802_11_SUPPLICANT_PROFILE esupplicant_profile;
        /** Extended version */
        HostCmd_DS_VERSION_EXT verext;
        /** Adhoc Coalescing */
        HostCmd_DS_802_11_IBSS_STATUS ibss_coalescing;
        /** Mgmt IE list configuration */
        HostCmd_DS_MGMT_IE_LIST_CFG mgmt_ie_list;
        /** System clock configuration */
        HostCmd_DS_ECL_SYSTEM_CLOCK_CONFIG sys_clock_cfg;
        /** MAC register access */
        HostCmd_DS_MAC_REG_ACCESS mac_reg;
        /** BBP register access */
        HostCmd_DS_BBP_REG_ACCESS bbp_reg;
        /** RF register access */
        HostCmd_DS_RF_REG_ACCESS rf_reg;
        /** EEPROM register access */
        HostCmd_DS_802_11_EEPROM_ACCESS eeprom;
        /** Memory access */
        HostCmd_DS_MEM_ACCESS mem;
        /** Target device access */
        HostCmd_DS_TARGET_ACCESS target;

