sj15712795029/stm32_sdio_wifi_marvell8801_wifi/STM32F4_WIFI_综合例程/component/wifi/marvell88w8801_core.h
        /** Inactivity timeout extend */
        HostCmd_DS_INACTIVITY_TIMEOUT_EXT inactivity_to;

        HostCmd_DS_SYS_CONFIG sys_config;
        HostCmd_DS_SYS_INFO sys_info;
        HostCmd_DS_STA_DEAUTH sta_deauth;
        HostCmd_DS_STA_LIST sta_list;
        HostCmd_DS_POWER_MGMT_EXT pm_cfg;

        /** Sleep period command */
        HostCmd_DS_802_11_SLEEP_PERIOD sleep_pd;
        /** Sleep params command */
        HostCmd_DS_802_11_SLEEP_PARAMS sleep_param;

        /** SDIO GPIO interrupt config command */
        HostCmd_DS_SDIO_GPIO_INT_CONFIG sdio_gpio_int;
        HostCmd_DS_SDIO_PULL_CTRL sdio_pull_ctl;
        HostCmd_DS_SET_BSS_MODE bss_mode;
        HostCmd_DS_CMD_TX_DATA_PAUSE tx_data_pause;

        HostCmd_DS_REMAIN_ON_CHANNEL remain_on_chan;
        HostCmd_DS_WIFI_DIRECT_MODE wifi_direct_mode;
        HostCmd_DS_WIFI_DIRECT_PARAM_CONFIG p2p_params_config;

        HostCmd_DS_COALESCE_CONFIG coalesce_config;
        HostCmd_DS_HS_WAKEUP_REASON hs_wakeup_reason;
        HostCmd_CONFIG_LOW_PWR_MODE low_pwr_mode_cfg;

        HostCmd_DS_RX_PKT_COAL_CFG rx_pkt_coal_cfg;
        HostCmd_DS_EAPOL_PKT eapol_pkt;
    } params;
} MLAN_PACK_END  HostCmd_DS_COMMAND;


/** Bit mask for TxPD status field for null packet */
#define MRVDRV_TxPD_POWER_MGMT_NULL_PACKET 0x01
/** Bit mask for TxPD status field for last packet */
#define MRVDRV_TxPD_POWER_MGMT_LAST_PACKET 0x08

/** Packet type: 802.11 */
#define PKT_TYPE_802DOT11   0x05
#define PKT_TYPE_MGMT_FRAME 0xE5
/** Packet type: AMSDU */
#define PKT_TYPE_AMSDU      0xE6
/** Packet type: BAR */
#define PKT_TYPE_BAR        0xE7
/** Packet type: debugging */
#define PKT_TYPE_DEBUG      0xEF

/** TxPD descriptor */
typedef  struct _TxPD
{
    /** Command Header : pack_len */
    uint16_t pack_len;
    /** Command Header : pack_type */
    uint16_t pack_type;
    /** BSS type */
    uint8_t bss_type;
    /** BSS number */
    uint8_t bss_num;
    /** Tx packet length */
    uint16_t tx_pkt_length;
    /** Tx packet offset */
    uint16_t tx_pkt_offset;
    /** Tx packet type */
    uint16_t tx_pkt_type;
    /** Tx Control */
    uint32_t tx_control;
    /** Pkt Priority */
    uint8_t priority;
    /** Transmit Pkt Flags*/
    uint8_t flags;
    /** Amount of time the packet has been queued in the driver (units = 2ms)*/
    uint8_t pkt_delay_2ms;
    /** Reserved */
    uint8_t reserved1;
    uint8_t payload[1]; // 数据链路层上的帧
} MLAN_PACK_END TxPD, *PTxPD;

/** RxPD Descriptor */
typedef  struct _RxPD
{
    /** Command Header : pack_len */
    uint16_t pack_len;
    /** Command Header : pack_type */
    uint16_t pack_type;
    /** BSS type */
    uint8_t bss_type;
    /** BSS number */
    uint8_t bss_num;
    /** Rx Packet Length */
    uint16_t rx_pkt_length;
    /** Rx Pkt offset */
    uint16_t rx_pkt_offset;
    /** Rx packet type */
    uint16_t rx_pkt_type;
    /** Sequence number */
    uint16_t seq_num;
    /** Packet Priority */
    uint8_t priority;
    /** Rx Packet Rate */
    uint8_t rx_rate;
    /** SNR */
    int8_t snr;
    /** Noise Floor */
    int8_t nf;
    /** Ht Info [Bit 0] RxRate format: LG=0, HT=1
     * [Bit 1]  HT Bandwidth: BW20 = 0, BW40 = 1
     * [Bit 2]  HT Guard Interval: LGI = 0, SGI = 1 */
    uint8_t ht_info;
    /** Reserved */
    uint8_t reserved;
    uint8_t *payload;
} MLAN_PACK_END RxPD, *PRxPD;

/** TxPD descriptor */
typedef struct _UapTxPD
{
    /** Command Header : pack_len */
    uint16_t pack_len;
    /** Command Header : pack_type */
    uint16_t pack_type;
    /** BSS type */
    uint8_t bss_type;
    /** BSS number */
    uint8_t bss_num;
    /** Tx packet length */
    uint16_t tx_pkt_length;
    /** Tx packet offset */
    uint16_t tx_pkt_offset;
    /** Tx packet type */
    uint16_t tx_pkt_type;
    /** Tx Control */
    uint32_t tx_control;
    /** Pkt Priority */
    uint8_t priority;
    /** Transmit Pkt Flags*/
    uint8_t flags;
    /** Amount of time the packet has been queued in the driver (units = 2ms)*/
    uint8_t pkt_delay_2ms;
    /** Reserved */
    uint8_t reserved1;
    /** Reserved */
    uint32_t reserved;
} MLAN_PACK_END UapTxPD, *PUapTxPD;

/** RxPD Descriptor */
typedef struct _UapRxPD
{
    /** Command Header : pack_len */
    uint16_t pack_len;
    /** Command Header : pack_type */
    uint16_t pack_type;
    /** BSS Type */
    uint8_t bss_type;
    /** BSS number*/
    uint8_t bss_num;
    /** Rx packet length */
    uint16_t rx_pkt_length;
    /** Rx packet offset */
    uint16_t rx_pkt_offset;
    /** Rx packet type */
    uint16_t rx_pkt_type;
    /** Sequence number */
    uint16_t seq_num;
    /** Packet Priority */
    uint8_t priority;
    /** Reserved */
    uint8_t reserved;
} MLAN_PACK_END UapRxPD, *PUapRxPD;



#define TX_BUFFER_SIZE 1024
#define RX_BUFFER_SIZE (3*1024)


typedef enum
{
    CON_STA_NO_NONNECTED,
    CON_STA_CONNECTING,
    CON_STA_CONNECTED,
} connect_status_e;

typedef struct
{
    uint8_t mac_address[MAC_ADDR_LENGTH];	/* 要连接的地址 */
    uint8_t ssid[MAX_SSID_LENGTH];
    uint8_t ssid_len;
    uint8_t pwd[MAX_PHRASE_LENGTH];
    uint8_t pwd_len;
    uint8_t security;
    uint16_t cap_info;
    connect_status_e con_status;
} connect_info_t;

typedef struct _sta_mac_t
{
    uint8_t used;
    uint8_t sta_mac_address[MAC_ADDR_LENGTH];
} sta_mac_t;


typedef struct
{
	void (*wifi_init_result)(uint8_t status);
	void (*wifi_scan_result)(uint8_t *ssid,uint8_t rssi,uint8_t channel,uint8_t *encryption_mode);
	void (*wifi_connect_result)(uint8_t status);
	void (*wifi_start_ap_result)(uint8_t status);
	void (*wifi_stop_ap_result)(uint8_t status);
	void (*wifi_ap_connect_result)(uint8_t *name,uint8_t *mac,uint8_t *ip);
	void (*wifi_ap_disconnect_result)(uint8_t *mac);
}wifi_cb_t;

typedef struct
{
    uint8_t bss_type;
    uint8_t mac_address[MAC_ADDR_LENGTH];				/* 本地mac 地址 */
    uint8_t remote_mac_address[MAC_ADDR_LENGTH];	/* 如果作为STA mode下，连接的AP mode的地址 */
    sta_mac_t sta_mac[WIFI_CONF_MAX_CLIENT_NUM];
    uint32_t control_io_port;
    uint8_t *mp_regs;
    uint16_t write_bitmap;
    uint16_t read_bitmap;
    uint16_t curr_rd_port;
    uint16_t curr_wr_port;
    uint16_t mp_end_port;

    uint8_t* tx_data_ptr;

    connect_info_t con_info;
} mrvl88w8801_core_t;
typedef mrvl88w8801_core_t* pmrvl88w8801_core_t;

uint8_t mrvl88w8801_init(wifi_cb_t *cb);
uint8_t mrvl88w8801_deinit(void);
uint8_t mrvl88w8801_process_packet(void);
uint8_t mrvl88w8801_scan(uint8_t *channel,uint8_t channel_num,uint16_t max_time);
uint8_t mrvl88w8801_scan_ssid(uint8_t *ssid,uint8_t ssid_len,uint16_t max_time);
uint8_t mrvl88w8801_connect(uint8_t *ssid,uint8_t ssid_len,uint8_t *pwd,uint8_t pwd_len);
uint8_t mrvl88w8801_disconnect(void);
uint8_t mrvl88w8801_disconnect_sta(uint8_t *mac_address);
uint8_t *mrvl88w8801_get_send_data_buf(void);
uint8_t mrvl88w8801_send_date(uint8_t *data,uint16_t size);
uint8_t mrvl88w8801_cre_ap(uint8_t *ssid,uint8_t ssid_len,uint8_t *pwd,uint8_t pwd_len,uint8_t sec_type,uint8_t broadcast_ssid);
uint8_t mrvl88w8801_stop_ap(void);
uint8_t mrvl88w8801_show_sta(void);

#endif
